# ScrollbarVisibility Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PreviewControl..::..ScrollbarVisibility Property
PreviewControl Class See Also
---
The visibility of the preview view scrollbars.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ScrollbarVisibility ScrollbarVisibility { get; set; }
```

Visual Basic
---
```text
Public Property ScrollbarVisibility As ScrollbarVisibility
	Get
	Set
```

Visual C++
---
```text
public:
property ScrollbarVisibility ScrollbarVisibility {
	ScrollbarVisibility get ();
	void set (ScrollbarVisibility value);
}
```

# See Also
PreviewControl Class
Autodesk.Revit.UI Namespace